Ruby/Mi_Proyecto/myapp/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "tower", "aparment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "andres"], ["tower", ""], ["aparment", ""], ["created_at", "2016-07-13 00:57:53.306359"], ["updated_at", "2016-07-13 00:57:53.306359"]]
---
	def create
		@user=User.new(user_params)
		@user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "tower" = ?, "aparment" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Richard Rios Jaramillo"], ["tower", "Torre-1"], ["aparment", "305"], ["updated_at", "2016-07-13 19:34:05.798373"], ["id", 3]]
---
	def update
		@user=User.find(params[:id])
		@user.update(user_params)