Ruby/app3/app/controllers/apartments_controller.rb

SELECT  "towers".* FROM "towers" WHERE "towers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_tower
       @tower= Tower.find(params[:tower_id])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."tower_id" = ?  [["tower_id", 1]]
---
    def index

      @apartments=@tower.apartments.all

INSERT INTO "apartments" ("name", "tower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "jhsjhs"], ["tower_id", 1], ["created_at", "2016-07-12 21:04:16.730733"], ["updated_at", "2016-07-12 21:04:16.730733"]]
---
    def create
      @tower= Tower.find(params[:tower_id])


      @apartment=@tower.apartments.new(apartment_params)
	  @apartment.save