Ruby/app3/app/controllers/towers_controller.rb

   def index
    @towers=Tower.all
---
SELECT "towers".* FROM "towers"

  def edit
    @tower= Tower.find(params[:id])
---
SELECT  "towers".* FROM "towers" WHERE "towers"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @tower=Tower.new(tower_params)
    @tower.save
---
INSERT INTO "towers" ("name", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "torre 1"], ["level", "2"], ["created_at", "2016-07-12 21:03:27.080831"], ["updated_at", "2016-07-12 21:03:27.080831"]]

  def destroy
    @tower= Tower.find(params[:id])
    @tower.destroy
---
SELECT  "towers".* FROM "towers" WHERE "towers"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "towers" WHERE "towers"."id" = ?  [["id", 4]]

  def update
    @tower= Tower.find(params[:id])
    @tower.update(tower_params)
---
SELECT  "towers".* FROM "towers" WHERE "towers"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "towers" SET "name" = ?, "updated_at" = ? WHERE "towers"."id" = ?  [["name", "torre 2"], ["updated_at", "2016-07-14 15:17:12.620190"], ["id", 3]]